<template>
  <el-dialog :visible.sync="rulesShow" top="10vh" :modal="false" title="使用規約" @close="onClose" key="rulesDialog">
    <div class="ruleArea">
      <h3>「Step1ne」會員規約 </h3>
      <p></p>
      <p>您好： 歡迎您加入「 Step1ne」平台成為會員，當您選擇加入「Step1ne」平台成為會員時，即視為您已閱讀、瞭解並同意接受「Step1ne」平台會員規約之全部內容，若您不同意，請立即登出並停止使用本平台所提供之任何會員服務，您必須嚴格遵守「 Step1ne」平台中所有的政策規範，若您為未成年人，您應在您的法定代理人同意後，始得使用本平台之會員服務。「Step1ne」平台有權於任何時間修改或變更本會員規約之內容，您若於修改或變更後繼續使用「 Step1ne」 平台之服務，即視為您或您的法定代理人已閱讀、瞭解並同意接受該等修改或變更後之內容。</p>
      <p>以下您以「本人」或「會員」簡稱；德仁管理顧問有限公司經營所屬之品牌「 Step1ne」以 「本平台」簡稱。</p>
      <h3>第一條：本平台告知事項 </h3>
      <p>本平台現在或將來蒐集您之個人資料，依據我國相關個人資料保護規定及公司內部規 範，告知下列事項，請 詳閱：</p>
      <p>（一）蒐集之目的與情形： 本平台基於我國法令、契約或類似契約關係或經您同意之情形下，基於後述目的 為蒐集，如：代理與仲介業務、行銷、消費者及客戶管理與服務、電子商務服務、 調查、統計與研究分析、非公務機關依法定義務所進行個人資料之蒐集、處理及 利用、契約或類似契約或其他法律關係事務及其他經營合於營業登記項目或組 織章程所定業務。 </p>
      <p>（二）個人資料之類別： 本平台端視服務或作業內容，蒐集您個人資料之類別，如：識別類C001~C003、 特徵類C011~C014、家庭情形C021、職業C038、執照C039、教育、技術或其他 專業C051、CO52、受僱情形CO61、C062、C064、CO68，詳細內容請參照法務 部公告之「個人資料保護法之特定目的及個人資料之類別」。</p>
      <p>（三）個人資料之來源：</p>
      <p>1、使用本平台所提供仲介、媒合服務之自然人或法人。</p>
      <p>2、基於共同行銷、交互運用客戶資料或合作推廣關係之第三方。 </p>
      <p>3、本平台各項業務往來之第三方。 </p>
      <p>（四）個人資料利用之期間、對象、地區、方式： </p>
      <p>1、本平台所蒐集之個人資料，將於中華民國境內及利用對象 所在地，就第一點所訂蒐集目的之範圍及其存續期間內，作合 於我國相關法令且必要之利用。 </p>
      <p>2、個人資料之利用，除本平台外，將依本平台資訊安全管理規 範下分享或揭露予利用對象、依法有調查權或主管機關及受 本平台委任處理事務之廠商。3、除上述情形外，非經您同意、協助司法機關偵查犯罪或請求 協助調查，亦或有其他法令規定，本平台不得將您個人資料分 享或揭露予第三人或作蒐集目的外之利用。</p>
      <p>（五）本平台所保有您之個人資料，依據個資法第3條規定，您可行使 下列權利： </p>
      <p>1、得向本平台行使之權利： （1）請求查詢或閱覽。 （2）請求製給複製本。 （3）請求補充或更正。 （4）請求停止蒐集、處理或利用。 （5）請求刪除。</p>
      <p>2、得於本平台自行處理修改密碼、隱私及帳戶設定、修改基本 資料、編輯或刪除內容及下載留存於本平台內資訊。 </p>
      <p>3、倘本平台保有您個人資料是基於同意者，可依下述第4點方 式撤銷同意。 </p>
      <p>4、針對權利行使有任何意見或疑問，得於非假日時間與客服 專員連絡，週一至週五AM10：00~PM7：00請洽02 6605 7111，或透過信箱official@step1ne.com反應；若對於本平台蒐集、處理或利 用您個人資料有任何意見或疑問，在此提醒亦可向我國相關 主管機關主張權利。</p>
      <p>（六）會員不提供個人資料所致權益之影響： 本平台提供工作及機會的交流與媒合，若不加入成為本平台之網站會員或不提 供完整個人資料，本平台將無法適時或完整提供相關之服務，而將會影響工作交 流或媒合之機會。 </p>
      <p>（七）Cookies之使用： 當瀏覽本平台網站時，網站伺服器會自動接收並紀錄您所使用瀏覽器之伺服器 數值，包括網際網路協定位址（IP Address）、Cookies資料、瀏覽及點選網頁紀 錄、瀏覽網頁時間等，作為本平台增進網站服務之參考依據。</p>
      <h3>第二條：本平台提供之會員服務</h3>
      <p>本人充分瞭解本平台提供之會員服務內容如下：</p>
      <p>（一）會員訊息服務： 本條所稱「會員訊息服務」是指本平台得依本人之設定，以電子郵件或其他方式， 寄送本平台相關之服務訊息予本人，包括且不限於求職面試訊息、職涯資訊或會 員互動通知等訊息。</p>
      <p>（二）內容建立與分享： 本條所稱「內容建立與分享」是指本人在本平台發布之所有資料內容，本人同意 提供本平台非獨家、可轉讓、可再授權、全部免費之全球授權，惟當本人刪除本 人提供之內容或帳號時，則該部分之授權視為終止，但本人提供之內容已經由他 人分享至以他人帳號發表之內容，則不在此限。本人明瞭當本人使用公開設定發 布內容或資料時，即視為本人已允許所有人皆得存取或使用該資料，並且將該則 內容或資料與本人聯想在一起，故本人對於任何希望保密或不希望提供他人使 用之內容或資料，均不應發布於本平台上。 </p>
      <p>（三）串連第三方平台或開發商： 本條所稱「串連第三方平台或開發商」是指本平台提供之服務內容，可能包含連 結到第三方平台或提供由第三方程式開發人員開發之平台應用程式，本人必須 自行評估是否要使用此串連服務，對於本人使用此串連服務，本人須自行承擔風險。</p>
      <p>（四）會員互動服務： 本條所稱「會員互動服務」是指本人有權決定是否與其他會員進行互動，本人可 以透過隱私設定來決定是否與對方進行互動。提醒您，本平台沒有義務介入本人 與其他會員之間之爭執，亦不會因此而關閉本人或其他會員之帳號，除非本人或 會員違反本平台之使用規範且情節重大。</p>
      <h3>第三條：本人個人資料的管理、維護及利用</h3>
      <p>本人同意將本人於本平台填寫及留存之會員個人資料，無償且不附帶任何條件提供予 德仁管理顧問有限公司經營所屬之品牌「 Step1ne」蒐集、處理、國際傳輸及利用，包括：</p>
      <p>（一）作為 德仁管理顧問有限公司經營所屬之品牌「 Step1ne」提供之各項服務及收受訊息之用，例如 且不限於高階獵才、評量施測、市場調查問卷、面試徵才、專案招募 及受企業委託代為發送之會員資訊。 </p>
      <p>（二）作為統計與分析之用，例如：針對會員男女分佈、學歷、職務、 地區等為研究。分析結果之呈現方式僅有整體之數據及說明文字， 除供內部研究外，本平台得視需要對外公布該等數據及說明文字， 但不涉及特定個人資料之公開。</p>
      <p>（三）其他另經過本人以書面、電子郵件、傳真、網頁點選按鈕同意之 利用。 （四）本人同意除個人資料的維護與記錄外，本平台沒有義務儲存、 維護或備份本人所使用或發表的任何內容，本人於完成會員資料登 錄及成功送出後，本平台之電腦系統將會依照本人在本平台提供之 個人資料及修改予以紀錄。</p>
      <h3>第四條：會員資料特定目的外之利用 </h3>
      <p>本人同意本平台得將其合法所蒐集、處理及利用之本人之個人資料，基於共同行銷之目 的，予以揭露、轉介或交換予德仁管理顧問有限公司經營所屬之品牌「 Step1ne」其他成員交互運用，但前開資料應妥善 運用及管理，且 德仁管理顧問有限公司經營所屬之品牌「 Step1ne」成員應確保本人所提供之所有資料皆受到「隱私權保 護政策」之嚴格保護。</p>
      <h3>第五條：會員注意事項 </h3>
      <p>為了使用本平台提供之會員服務，本人同意以下事項：</p>
      <p>（一）本人保證所註冊登錄之個人資料（含國民身分證統一編號或他 國護照號碼、照片與其他附加檔案資料），登錄時均為本人正確、最 新及完整之資料，且絕無擅自利用他人名義、利用身分證字號產生 器或其他方法同時或先後為數筆同一人或不同人之登錄，或自為內 容不實之登錄，違反上述約定，本平台基於個人資料安全與正確之 維護有權逕行修改、移除或將本人列入拒絕往來用戶名單永久不得 使用本平台提供之會員服務。若涉及民刑事責任者，本平台如係自 行查獲不法或違約行為將依情節輕重保留是否提出刑事告訴、告發 或請求民事損害賠償之權利，或配合受害人向檢調或司法機關提供 本人之個人資料、連線紀錄或其他相關資料供查證。</p>
      <p>（二）本人同意須維持並更新本人資料，確保其為正確、最新及完整。 若本人提供任何錯誤或不實資料，本平台如係自行或經他人檢舉查 獲屬實，本平台有權選擇通知本人更正或暫停使用會員服務至本平 台通知恢復之日止或終止本人之帳號，並拒絕本人使用會員服務之 全部或一部分。 </p>
      <p>（三）如果本人不同意本平台之會員規約，則不應登錄成本平台會員 或使用本平台之任何服務。 </p>
      <p>（四）本人同意且了解，不得與他人共用同一帳號，亦不得將登入本 平台之帳號及密碼提供或透露予任何第三人，任何第三人因獲悉本 人帳號密碼而登入本人帳號所發生之任何問題或法律糾紛，概由本 人自行承擔所有後果。</p>
      <h3>第六條：本平台安全維護 </h3>
      <p>（一）本人同意不得於本平台騷擾、恐嚇其他會員或從事任何非法、 違反公序良俗之行為。 </p>
      <p>（二）本人同意不上傳病毒或其他攻擊程式碼。 </p>
      <p>（三）本人同意未經本平台事前書面同意，不得發布任何他人之個人 聯絡資訊。 </p>
      <p>（四）本人同意不發布任何誹謗侵害他人名譽或為謠言、猜測、捏造 不實言論等行為。 </p>
      <p>（五）本人同意不在本平台從事任何銷售或多層次傳銷或與發表與主 題無關的商業廣告行為。 </p>
      <p>（六）本人同意不會進行任何會導致本平台關閉、超載、損害正常運 作或外觀之行為。 </p>
      <p>（七）本人同意不得於於本平台公開蒐集其他使用者之聯絡資訊。 </p>
      <p>（八）本人同意若發生違反以上各項約定，經查明屬實者，本平台得 視情節輕重限制本人帳號的服務使用權或刪除本人會員資格，並拒絕本人爾後使用本平台各項服務之權利。本平台另可將本人之姓氏、會員代號或暱稱及事實經過公告於本平台。</p>
      <h3>第七條：保護其他人權利</h3>
      <p>（一）本人同意不會在本平台張貼任何侵犯、揭露他人隱私或純屬他 人私領域之言論或物品。 </p>
      <p>（二）對於本人張貼的任何內容或資料若有違反本平台政策或會員規 約，本人同意本平台有權逕行移除。若經本平台通知仍未改善者，本 平台有權停止本人繼續使用本平台之權利。 </p>
      <p>（三）本人同意且了解，若本人須蒐集部份會員資料，本人必須事先 徵得該會員之同意，並明確表示是本人（而非本平台）蒐集其個人資 料，並明確告知蒐集後之處理與利用方式。 </p>
      <p>（四）本人同意不會亦不得誘使他人於本平台，發布其個人身分證明 文件或敏感性個人資料。 </p>
      <p>（五）本人同意且了解，若因本人未遵守本平台會員規約，致侵害他人權益或造成本平台之損害（包括且不限於商譽之損害），本人同意 負擔所有相關之損害賠償或回復原狀之責任。</p>
      <h3>第八條：本平台之免責約定</h3>
      <p>（一）本人明瞭於本平台發布之內容或資料，若非本人所獨立創作或 是任何人得公開使用之著作，而是重製或引用他人享有著作權之著 作時，本人應注意著作權法之合理使用規範，若生爭議，本人除應立 即刪除涉有侵害他人著作權之內容或資料外，並應主動與他人協商 解決，本平台對此不負任何賠償責任。若經他人檢舉並查明屬實，本 平台有權立即刪除侵害他人著作權之相關著作。 </p>
      <p>（二）本人明瞭本人經由本平台取得之資訊或建議，本平台並不擔保 其為完全正確無誤。本平台對於本服務所提供之資訊或建議有權隨 時修改或刪除。 </p>
      <p>（三）本平台隨時會與廠商等第三人（「內容提供者」）合作，由其提供 包括新聞、訊息、電子報等不同內容供本平台刊登，本平台對其所提 供之內容並不做實質之審查或修改，對該內容之正確真偽亦不負任 何責任。對該內容之正確真偽，須由本人自行判斷之。 </p>
      <p>（四）本人明瞭在本平台瀏覽到的所有廣告內容、文字與圖片之說 明、展示樣品或其他銷售資訊，均由各該廣告商所設計與提出。本人 需自行斟酌與判斷該廣告之正確性與可信度。本平台僅接受委託予 以刊登，不對前述廣告內容負擔保責任。 </p>
      <p>（五）本人同意不對本平台或 德仁管理顧問有限公司經營所屬之品牌「 Step1ne」就以上情形之發生 為民事損害賠償之請求，亦不任意公開散佈有損本平台或 德仁管理顧問有限公司 或其負責人、董監事、受僱人商譽或名譽之言論或文字。</p>
      <h3>第九條：隱私權保護政策 </h3>
      <p>本人的個人資料及相關使用服務紀錄受本平台之隱私權保護政策規範與管理，本人明 瞭該隱私權保護政策亦構成本會員規約之一部份。</p>
      <h3>第十條：準據法及管轄法院 </h3>
      <p>本會員規約之解釋與適用，以中華民國法律為準據法。本人與德仁管理顧問有限公司經營所屬之品牌「 Step1ne」共同約定，若因使用本平台發生爭議而有訴訟之必要時，雙方合意以台灣台北地方 法院為第一審管轄法院。</p>
      <p class="update">修訂日期：2021 年 08 月</p>
    </div>
  </el-dialog>
</template>

<script>
  import { mapGetters, mapActions } from 'vuex';
  import dialogMixin from '@/mixin/dialog.js';

  export default {
    name: 'RulesDialog',
    mixins: [dialogMixin],
    computed: {
      ...mapGetters('dialog', ['rulesShow']),
    },
    methods: {
      ...mapActions('dialog', ['setRulesShow']),
      onClose() {
        this.setRulesShow(false);
      },
    },
  };
</script>


<style lang="scss" scoped>
  .ruleArea {
    h3 {
      @include font(16, bold);
    }

    p {
      line-height: 2;

      + h3 {
        margin-top: 1em;
      }
    }

    .update {
      margin: 1em 0;
      text-align: right;
    }
  }
</style>